Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method
Overload List
Name | Description
Split(Beam, Point)
 Splits the beam and creates a new one in the given position.
Split(CircleRebarGroup, Line)
 Splits the circle rebar group and creates a new one in the given position.
Split(ContourPlate, Polygon)
 Splits the contour plate and creates a new one along the given polygon.
Split(CurvedRebarGroup, Line)
 Splits the curved rebar group and creates a new one in the given position.
Split(LoftedPlate, Point)
 Splits the lofted plate and creates a new one in the given position.
Split(PolyBeam, Point)
 Splits the polybeam and creates a new one in the given position.
Split(RebarGroup, Line)
 Splits the rebar group and creates a new one in the given position.
Split(SingleRebar, Line)
 Splits the single rebar and creates a new one in the given position.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace